Repository: lenoryv/collective.spanishdocumentation
Catalog: buildout.coredev/omegat/project_save.tmx
Source language: en_us
Languages: es_ve

source: # my modified packages
es_ve: # mi paquetes modificados

source: # others
es_ve: # otros

source: &tldr; Technically, we want to see it completed for the release to which it’s assigned.
es_ve: &tldr; Técnicamente, nosotros queremos ver eso completado para la publicación a la cual fue asignada.

source: (ef978a happens to be the last commit in the feature branch's history before it was branched off of 4.1.
es_ve: (ef978a pasa a ser la ultima revisión en el histórico de la branch característica antes de que sea bifurcaba de la versión 4.1.

source: * **Patches** Historically we encouraged people to submit patches to the ticket collector.
es_ve: * **Patches** Históricamente nosotros animamos a las personas para entregar patches al colector del ticket.

source: * *Community-edited* documents.
es_ve: * Documentos *editado colectivamente en comunidad*.

source: * *Curated* documents.
es_ve: * Documentos *mantenidos*.

source: * *How do I know when my package got made?*
es_ve: * *¿Cómo puedo saber si se tomo mis cambios en mi paquete?*

source: * A brief description of the package's purpose
es_ve: * Una breve descripción del propósito del paquete

source: * After your form has been signed and received, fill out a trac ticket for core access at https://dev.plone.org/newticket.
es_ve: * Después de que su forma ha sido firmada y recibida, usted registre un ticket en el sistema trac para acceso de núcleo de Plone en https://dev.plone.org/newticket.

source: * Answer any questions the PLIP implementor has, technically and otherwise
es_ve: * Responda a las preguntas formuladas por el implementador tiene sobre el PLIP, técnica y de cualquier otra

source: * Any concerns, issues still remaining
es_ve: * Cualquier inquietud, las incidencias aún permanecen

source: * Any new code must:
es_ve: * Cualquier nuevo código fuente debería:

source: * Any new packages must be in a branch in the plone namespace in github.
es_ve: * Cualquiera de los nuevos paquetes debe estar en una branch bajo el namespace plone en github.

source: * Any weird buildout things
es_ve: * Cualquier cosas buildout extrañas

source: * Are all test cases for the modules(s) and for Plone passing?
es_ve: * ¿Todos sus casos de prueba para los módulos y para Plone se ejecutan sin ningún problema?

source: * Are there any bugs?
es_ve: * ¿Hay algún error?

source: * Are there any deprecated or old style ME/TAL lines of code such as using DateTime?
es_ve: * ¿Hay alguna líneas de código con estilo obsoleto o viejo ME/TAL como el uso de DateTime?

source: * Are there any new permissions and do they work properly?
es_ve: * ¿Hay permisos nuevos y ellos trabajan correctamente?

source: * Are there any performance considerations?
es_ve: * ¿Hay alguna consideraciones de rendimiento?

source: * Are they importing deprecated modules?
es_ve: * ¿Están importando módulos obsoletos?

source: * Ask and (especially) answer questions on stack overflow and :doc:`IRC <culture>` with a focus on getting to know the active developers a bit.
es_ve: * Preguntar y (especialmente) responder a preguntas acerca del stack desbordamiento y el canal :doc:`IRC <culture>` usarlo con un enfoque para conocer un poco a los desarrolladores activos.

source: * Assist with finding additional help when needed to complete the implementation in a timely matter
es_ve: * Asistir en la búsqueda de ayuda adicional cuando sea necesario para completar la implementación en un tiempo oportuno

source: * Attend a conference/symposium or participate in a sprint/tuneup.
es_ve: * Atender un simposio/conferencia o participar en un sprint/tuneup

source: * Avoid tal:on-error, since this swallows exceptions
es_ve: * Evitar tal:on-error, desde estas excepciones swallows

source: * Be :doc:`Properly Documented <documentation>`
es_ve: * Estar :doc:`documentado apropiadamente <documentation>`

source: * Be tested (XXX: link here?)
es_ve: * Tiene que estar probado (XXX: link here?)

source: * Common gotchas
es_ve: * Común gotchas

source: * Compatibility information (what versions of Plone does it work with?)
es_ve: * Información de compatibilidad (qué versiones de Plone trabaja con que?)

source: * Did you add your changed packages to checkouts.cfg?
es_ve: * ¿Usted añadió sus paquetes cambiados al archivo checkouts.cfg?

source: * Did you fix the original bug?
es_ve: * ¿Usted corrigió el fallo original?

source: * Did you remove any extra code and lingering pdbs?
es_ve: * ¿Usted removió lineas extras de código y PDB persistentes?

source: * Did you update CHANGES.rst in each packages you touched?
es_ve: * ¿Usted actualizo el archivo CHANGES.rst en cada paquete que usted modifico?

source: * Did you write a test case for that bug?
es_ve: * ¿Usted escribió un caso de prueba para su fallo?

source: * Do error and status messages make sense?
es_ve: * ¿No mensajes de error y los mensajes de estado tiene sentido?

source: * Do fields handle whacky data?
es_ve: * ¿Los campos a manejar data estrafalarias?

source: * Do not acquire anything unless absolutely necessary, especially tools.
es_ve: * No adquirir nada menos que sea absolutamente necesario, especialmente herramientas.

source: * Do not put too much logic in ZPT (use Views instead!)
es_ve: * No coloque mucho de la lógica en las Plantillas de pagina Zope - ZPT (use Views en este caso!)

source: * Do not use tabs in Python code!
es_ve: * ¡No utiliza tabuladores en código de Python!

source: * Does everything flow nicely for novice and advanced users?
es_ve: * ¿Todo se comporta bien para principiantes y usuarios avanzados?

source: * Does the Javascript work in all currently supported browsers?
es_ve: * ¿El Javascript funciona en todos los navegadores soportados actualmente?

source: * Does the PLIP actually do what the implementors proposed?
es_ve: * ¿Este PLIP realmente hace lo que los implementadores propusieron?

source: * Does the PLIP use views appropriately and avoiding too much logic?
es_ve: * ¿La vista de usuario del PLIP adecuadamente y evitando demasiada lógica?

source: * Does the code adhere to PEP8 standards (more or less)?
es_ve: * ¿El código fuente se adhiere al estándar PEP8 (más o menos)?

source: * Does the javascript meet our set of javascript standards?
es_ve: * ¿El javascript conocer a nuestro conjunto de normas javascript?

source: * Does the work proposed belong in Plone now, in the future?
es_ve: * ¿El trabajo propuesto en Plone deber estar ahora, en el futuro?

source: * Does this PLIP need a usability review?
es_ve: * ¿Hace este PLIP necesidad una revisión de usabilidad?

source: * Don't use hasattr() - this swallows exceptions, use getattr(foo, 'bar', None) instead.
es_ve: * No use hasattr() - esto son swallows exceptions, por favor, en este caso use getattr(foo, 'bar', None).

source: * Encourage the PLIP author by constantly giving feedback and encouragement
es_ve: * Fomentar el autor PLIP por su constantemente retroalimentación y estímulo

source: * End users who use Plone for content editing but don't manage the site.
es_ve: * Los usuarios finales quiénes utilizan Plone para editar contenido pero no administran el sitio.

source: * Get your feet wet by contributing to the collective.
es_ve: * Puede iniciarse en la contribuciones en el repositorio de collective.

source: * Have clear code
es_ve: * Tener el código fuente limpio

source: * How to use them (in English—not doctests!)
es_ve: * Documentos ¿Cómo usar? (¡doctests que no estén en Inglés!)

source: * How will novice end users respond to the change?
es_ve: * ¿Cómo los usuarios finales novatos responden al cambio?

source: * If you are on Mac OSX, you will need to install XCode.
es_ve: * Si usted esta usando un Mac OSX, necesitara instalar XCode.

source: * Indent properly, even in HTML.
es_ve: * Indentar apropiadamente, incluso en HTML.

source: * Information about architecture
es_ve: * Información aproximadamente de la arquitectura

source: * Installation information (How do I get it working?)
es_ve: * Información de instalación (Cómo consigo que funcione?)

source: * Integrators who need to extend the functionality of the package in code.
es_ve: * Los integradores quiénes necesitan extender la funcionalidad del paquete desde el código fuente.

source: * Is the PLIP consistent with the rest of Plone?
es_ve: * ¿El PLIP es compatible con el resto de Plone?

source: * Is the change itself properly documented?
es_ve: * ¿Este cambio en si mismo esta correctamente documentado?

source: * Is the code properly documented?
es_ve: * ¿Esta el código fuente adecuadamente documentado?

source: * Is the corresponding documentation for the end user, be it developer or plone user, sufficient?
es_ve: * ¿Hay suficiente documentación disponible correspondiente para el usuario final, ya sea programador o usuario plone?

source: * Is the implementation usable?
es_ve: * ¿Es usable la implementación?

source: * Is the rendered html standards compliant?
es_ve: * ¿Es compatible con lo que dicta el estándar html?

source: * Is there any code in a loop that could potentially be a performance issue?
es_ve: * ¿Hay algún código fuente en un bucle que podría ser un problema de rendimiento?

source: * Is this PLIP more appropriate as a qualified add-on?
es_ve: * ¿Es esta PLIP más apropiado a ser calificado como un add-on?

source: * Is this PLIP too risky?
es_ve: * ¿Es esta PLIP demasiado arriesgada?

source: * Is this code maintainable?
es_ve: * ¿Es este código fuente mantenible?

source: * Is this idea well baked and expressed clearly?
es_ve: * ¿Esta idea esta bien cocinada y se expresa con claridad?

source: * Is validation up to snuff and sensical?
es_ve: * Es validación y cuestión de puro sentido?

source: * Is your code consistent with our :doc:`style`?
es_ve: * ¿Su código consiste con nuestro :doc:`style`?

source: * Keep the implementor aware of timelines and push to get things done on time
es_ve: * Cuidar que el implementador logre la lineas de tiempo y coloque las cosas listas a tiempo

source: * Links to issue trackers, mailing lists, and other ways to get help.
es_ve: * Enlaces para reportar errores, listas de correo, y otras maneras de conseguir ayuda.

source: * Links to other sources of documentation
es_ve: * Enlaces a otras fuentes de documentación

source: * Most importantly, the PLIP reviewers must be able run buildout and everything should "just work" (tm).
es_ve: * Lo mas importante, los revisores PLIP debe estar disponible a ejecutarse con buildout y cada cosa debería "solo trabajar" (tm).

source: * Never use a bare except.
es_ve: * Nunca usar una excepción bare.

source: * Never, ever put any HTML in Python code and return it as a string
es_ve: * Nunca, coloque ningún código HTML dentro del código Python y lo retorne como una cadena

source: * Only commit directly to the development branch if you're confident your code won't break anything badly and the changes are small and fairly trivial.
es_ve: * Solamente generar una revisión directamente a la branch de desarrollo si usted esta seguro que su código no causa ninguna falla y los cambios son pequeños y triviales.

source: * Please try to make one change per commit.
es_ve: * Por favor, trate de hacer un cambio por cada revisión.

source: * Remember to add i18n tags in ZPTs and Python code
es_ve: * Recuerde agregar etiquetas i18n en ZPTs y código Python

source: * Sign and snail mail the contributor agreement at http://plone.org/foundation/contributors-agreement/agreement.pdf/at_download/file.
es_ve: * Firme y envié un correo con el contributor agreement en http://plone.org/foundation/contributors-agreement/agreement.pdf/at_download/file.

source: * Site administrators who install and configure the package.
es_ve: * Los administradores del sitio quiénes instalan y configurar el paquete.

source: * Sysadmins who need to maintain the server running the software.
es_ve: * Los administradores de sistemas quiénes necesitan mantener que el servidor ejecute el software.

source: * URLs pointing to all documentation created/updated
es_ve: * Las direcciones URLs que apuntan a toda la documentación creada/actualizada

source: * User the current idioms of development
es_ve: * Usa los idiomas actuales de desarrollo

source: * We have a few angels that follow the changes and each commit to see what happens to their favourite CMS!
es_ve: * Nosotros tenemos un grupo de ángeles que siguen los cambios y cada revisión aplicada para ver que ha sucedido de nuevo en el código fuente de nuestro favorito CMS!

source: * Were there any errors running buildout?
es_ve: * ¿Hubo allí algunos errores al ejecutar el buildout?

source: * What is size and status of the work needed to be done?
es_ve: * ¿Cual es el tamaño y estatus del trabajo necesitado para culminarlo?

source: * What the features are
es_ve: * ¿Qué características poseen?

source: * XXX: What else?
es_ve: * XXX: ¿Algo mas?

source: * `Be tested <http://collective-docs.plone.org/en/latest/testing_and_debugging/index.html>`_
es_ve: * `Estar probado <http://collective-docs.plone.org/en/latest/testing_and_debugging/index.html>`_

source: * `Collective Plone developer documentation <http://collective-docs.readthedocs.org/en/latest/index.html>`_.
es_ve: * `Documentación para el programador en Plone Collective <http://collective-docs.readthedocs.org/en/latest/index.html>`_.

source: * `Developer Manual <http://plone.org/documentation/manual/developer-manual>`_
es_ve: * `Manual de Desarrollo <http://plone.org/documentation/manual/developer-manual>`_

source: * `GCC <http://gcc.gnu.org/>`_ in order to compile ZODB, Zope and lxml.
es_ve: * `GCC <http://gcc.gnu.org/>`_ para compilar ZODB, Zope y lxml.

source: * `Installing Plone <http://plone.org/documentation/manual/installing-plone>`_
es_ve: * `Instalando Plone <http://plone.org/documentation/manual/installing-plone>`_

source: * `Knowledgebase on plone.org <http://plone.org/documentation/kb>`_.
es_ve: * `Base de conocimiento en plone.org <http://plone.org/documentation/kb>`_.

source: * `Plone Oriented Shpinx Documentation <http://collective-docs.plone.org/en/latest/introduction/writing.html>`_
es_ve: * `Documentación Shpinx orientada a Plone <http://collective-docs.plone.org/en/latest/introduction/writing.html>`_

source: * `Sphinx reST Primer <http://sphinx.pocoo.org/rest.html>`_
es_ve: * `Manual básico Sphinx reST <http://sphinx.pocoo.org/rest.html>`_

source: * `Theme Reference <http://plone.org/documentation/manual/theme-reference>`_
es_ve: * `Referencia de Temas <http://plone.org/documentation/manual/theme-reference>`_

source: * `User Manual <http://plone.org/documentation/manual/plone-4-user-manual>`_
es_ve: * `Manual de Usuario <http://plone.org/documentation/manual/plone-4-user-manual>`_

source: * `VirtualEnv <http://www.virtualenv.org/en/latest/index.html>`_ in the proper python environment.
es_ve: * `VirtualEnv <http://www.virtualenv.org/en/latest/index.html>`_ en el apropiado entorno python.

source: * `libxml2 and libxslt <http://xmlsoft.org/XSLT/downloads.html>`_, including development headers.
es_ve: * `libxml2 y libxslt <http://xmlsoft.org/XSLT/downloads.html>`_, incluyendo los encabezados de desarrollo.

source: * are implementing a non-trivial change
es_ve: * están llevando a cabo un cambio no trivial

source: * are just getting started,
es_ve: * usted se esta iniciando,

source: * are not sure about your changes
es_ve: * usted no esta seguro acerca de sus cambios

source: * want feedback/code review
es_ve: * quiere revisión de comentario/código

source: **Note** This example is just about as terrible as they come.
es_ve: **Nota** Este ejemplo es casi tan terrible como el que viene.

source: *Most importantly*, if you didn't do it earlier, edit checkouts.cfg in the buildout directory and add your changes package to the auto-checkout list.
es_ve: *Lo más importante*, si no lo hizo antes, edite el checkouts.cfg en el directorio de buildout y agregar el paquete al cual le hizo sus cambios a la lista de auto-checkout.

source: *Note*: Branching or forking is your choice.
es_ve: *Nota*: Hacer Branch o fork es su elección.

source: *Note*: Tests take a long time to run.
es_ve: *Nota*: Las pruebas toman un tiempo en ejecutarse.

source: *Note*: you still need to update checkouts.cfg in the correct branches of buildout.coredev!
es_ve: *Nota*: todavía necesitas actualizar el archivo *checkouts.cfg* en las branches correctas de proyecto buildout.coredev!

source: ===== Legally, you can NOT contribute code unless you have signed the :doc:`contributor agreement <agreement>`.
es_ve: ========= Legalmente, NO puedes contribuir código a no ser que usted allá firmado el :doc:`acuerdo de acuerdo <agreement>`.

source: ======================= Plone Developer Culture =======================
es_ve: ============================== Cultura de desarrollo en Plone ==============================

source: > ../plone42devpy/bin/python bootstrap.py # (where "python" is your python 2.6 binary).
es_ve: > ../plone42devpy/bin/python bootstrap.py # (donde "python" es su binario python 2.6).

source: > cd ~/buildouts # or wherever you want to put things
es_ve: > cd ~/buildouts # o donde tu quieras colocar sus cosas

source: A PLIP is a PLone Improvement Proposal.
es_ve: Del ingles, PLIP significa PLone Improvement Proposal, el cual es una propuesta de mejora a Plone.

source: A PLIP is just a ticket with a special template.
es_ve: Un PLIP es un ticket con una plantilla especial.

source: A bug or minor change does normally not need to go through a review process - a PLIP does.
es_ve: Un fallo o cambio menor normalmente no necesita ir a través del proceso de revisión - que hace un PLIP.

source: A champion should:
es_ve: Un defensor debería:

source: A changelog looks something like::
es_ve: Un changelog se parece a algo así::

source: A common way to start contributing is to participate in a Plone tune-up day.
es_ve: Una manera común de empezar contribuyendo es para participar en un día de tune-up de Plone.

source: A couple housekeeping things before moving on.
es_ve: Un par de cosas hay que hacer antes de continuar.

source: A couple quick reminders:
es_ve: Un par de recordatorios rápidos:

source: A good PLIP is sufficiently clear for a knowlegable Plone user to be able to understand the proposed changes, and sufficiently detailed for the release manager and other developers to understand the full impact the proposal would have on the codebase.
es_ve: Un buen PLIP es suficientemente claro para un usuario conocedor de Plone disponible a entender la propuesta de cambios, y suficientemente detallada para el release manager y otros desarrolladores entender el completo impacto de la propuesta puede tener el código base.

source: A new ticket template will reload and you should plan to fill in all of the fields.
es_ve: Un nueva plantilla de ticket se cargara y usted debería planear llenarla en todas sus secciones y campos.

source: API documentation)
es_ve: documentación de API)

source: Adding ``*.pyc *~.nib *.egg-info .installed.cfg *.pt.py *.cpt.py *.zpt.py *.html.py *.egg`` to your subversion config's global-ignores has been suggested as a more permanent solution.
es_ve: Añadiendo ``*.pyc *~.nib *.egg-info .installed.cfg *.pt.py *.cpt.py *.zpt.py *.html.py *.egg`` a su configuración subversion global-ignores ha sido sugerido como una solución más permanente.

source: After all other PLIPS are merged, a release is cut.
es_ve: Después de que todos los otros PLIPS son fusionado, una publicación se corta.

source: After checking it out with mr.developer, create your own branch with::
es_ve: Después de comprobarlo con mr.developer, cree su propia branch con::

source: After the PLIP has been accepted by the framework team and the release manager, you will be asked to merge your work into the main development line.
es_ve: Después de que el PLIP ha sido aceptado por el equipo de framework y el release manager, se le pedirá que fusionar su trabajo dentro de la línea de desarrollo principal.

source: After the PLIP is accepted, the Framework Team will try to judge complexity and time to completion and assign it to a milestone.
es_ve: Después que la PLIP es aceptada, el equipo del Framework tratara de juzgar la complejidad y el tiempo para completar y asignar este en un hito.

source: After the migration to github, the community decided to maintain this spirit.
es_ve: Después de que la migración de los repositorios svn al servicio github, la comunidad decidió mantener este espíritu.

source: After the module level tests run with your change, please make sure other modules aren't affected by the change by running the full suite::
es_ve: Después de las pruebas de nivel de módulo se ejecutan con su cambio realizado, por favor asegúrese de que los otros módulos no se ven afectados por su cambio realizado, para esto ejecute todas as pruebas con el siguiente comando::

source: After your plip is written, solicit feedback on your idea on the plone-developers mailing list.
es_ve: Después que su plip es escrita, solicite un comentario de sus ideas en la lista de correo plone-developers.

source: Again, this is only necessary if the package wasn't found in the end.
es_ve: Otra vez, esto es sólo necesario si el paquete no fue encontrado al final.

source: All about PLIPS --------------- What is a PLIP?
es_ve: Todo sobre los PLIPS -------------------- ¿Qué es un PLIP?

source: All communication with you occurs on the PLIP ticket itself so please keep your eyes and inbox open for changes.
es_ve: Toda la comunicación con usted ocurrirá en ticket PLIP ticket en si mismo por favor, este pendiente a su bandeja de entrada de su correo electrónico por cada cambios aplicado al ticket.

source: Although this technically isn't a buildout issues, it happens when running buildout so I'm putting it under buildout issues.
es_ve: A pesar de que esto técnicamente no es un incidente buildout, pasa cuándo esta ejecutando buildout, entonces yo lo estoy poniéndolo en las incidencias buildout.

source: Altternatively, we can manage checkouts from the command line, by using mr.developer's ``bin/develop`` command to get the latest source.
es_ve: Alternativamente, nosotros podemos administrar los checkouts desde la línea de comando, usando el comando de mr.developer ``bin/develop`` para conseguir la fuente de paquetes más reciente.

source: An API reference provides information about the package's public API (that is, the code that the package exposes for use from external code.) It is meant for random access to remind the reader of how a particular class or method works, rather than for reading in its entirety.
es_ve: Una referencia de API proporciona información sobre la API pública del paquete (eso es, el código que el paquete expone para uso de código externo.) Eso significa para el acceso aleatorio a recordar el lector de cómo una clase particular o un método trabajo, más que para leer enteramente.

source: And then cherry-pick the commit (you can get the SHA hash from git log).
es_ve: Y entonces con el comando git cherry-pick y el número de revisión (usted puede obtener el número SHA hash desde el git log).::

source: And this is preventing bin/develop up from updating all the eggs.
es_ve: Y ejecutando este comando bin/develop up esta previniendo la actualización de todos los paquetes egg.

source: Anyone may `contribute <http://collective-docs.readthedocs.org/en/latest/introduction/developermanual.html>`_.
es_ve: Cualquiera tal ves puede `contribuir <http://collective-docs.readthedocs.org/en/latest/introduction/developermanual.html>`_.

source: Anyone who has signed a Plone core contributor agreement can work on a PLIP.
es_ve: Cualquiera quién ha firmado el Plone core contributor agreement puede trabajar en un PLIP.
